{"@odata.context":"https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity","createdDateTime":"2024-05-08T14:51:49.3527245Z","creationSource":"GPAnalytics","description":"","lastModifiedDateTime":"2024-05-08T20:20:22.9453101Z","name":"Windows  23H2 Security Baseline (User)","platforms":"windows10","priorityMetaData":null,"roleScopeTagIds":["0"],"settingCount":3,"technologies":"mdm","id":"6434c956-debd-4b4b-8938-284889546e4e","templateReference":{"templateId":"","templateFamily":"none","templateDisplayName":null,"templateDisplayVersion":null},"settings":[{"id":"0","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_admx_wpn_nolockscreentoastnotification_1","children":[]}}},{"id":"1","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_internetexplorer_allowautocomplete","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_internetexplorer_allowautocomplete_0","children":[]}}},{"id":"2","settingInstance":{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_experience_allowwindowsspotlight","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_experience_allowwindowsspotlight_1","children":[{"@odata.type":"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance","settingDefinitionId":"user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight","settingInstanceTemplateReference":null,"choiceSettingValue":{"settingValueTemplateReference":null,"value":"user_vendor_msft_policy_config_experience_allowthirdpartysuggestionsinwindowsspotlight_0","children":[]}}]}}}]}